uhnp/src/DataProcessors/тн_ЗагрузкаВводНачальныхДанных76_02/тн_ЗагрузкаВводНачальныхДанных76_02.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ЗагрузкаВводНачальныхДанных76_02</name>
  <comment>// Иванов Василий 06.02.2025 Выполнение задач №000052552</comment>
</mdclass:DataProcessor>

uhnp/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРасчетов</name>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыПервичныхДокументов/ТипыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПервичныхДокументов</name>
  <enumValues>
    <name>ПриобретениеУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяНакладная</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранение</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДавальцу</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПереработчика</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеализации</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретения</name>
  </enumValues>
  <enumValues>
    <name>АктПремииКлиенту</name>
  </enumValues>
  <enumValues>
    <name>АктПремииПоставщика</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПервичныйДокумент/ПервичныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПервичныйДокумент</name>
  <registerRecords>InformationRegister.ИсправленияДокументов</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНОСиНМА</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПервичногоДокумента</name>
    <type>
      <types>EnumRef.ТипыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <type>
      <types>EnumRef.ПорядокРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НалогообложениеНДС</name>
    <comment>№000046864</comment>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/DataProcessors/тн_ЗагрузкаВводНачальныхДанных76_02/Forms/Форма/Module.bsl
&НаСервере
Процедура СоздатьДокиНаСервере()
	
	//Пример = Документы.ВводОстатков.НайтиПоНомеру("00-00000069",);
	//Возврат;
	
	Результат.Очистить();
	
	КолвоСтрокВДокументе = 2999; // в создаваемых документах
	КолОрг	 	= 1;
	КолОргID 	= 2;
	КолСчет	 	= 3;
	КолВалютаКод= 4;
	КолВалСумма	= 6;
	КолСумма	= 5;
	КолКон	 	= 7;
	КолКонID 	= 8;
	КолДог	 	= 9;
	КолДогID 	=10;
	
	КолДок		=11;
	КолДокДата	=12;
	КолДокНомер	=13;
	КолДокСумма	=14;
	КолДокВалюта=15;
	КолДокКурс	=16;
	
	// Ищем первую строку с данными
	Для ПерваяСтрокаДанныхВФайле = 1 По ТабДокумент.ВысотаТаблицы Цикл
		Если  ТабДокумент.Область(ПерваяСтрокаДанныхВФайле,КолОрг,ПерваяСтрокаДанныхВФайле,КолОрг).Текст = "Организация" Тогда
			ПерваяСтрокаДанныхВФайле = ПерваяСтрокаДанныхВФайле +1;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если  ПерваяСтрокаДанныхВФайле > ТабДокумент.ВысотаТаблицы Тогда
		Результат.ДобавитьСтроку("Файл не соответствует");
		Возврат;
	Иначе
		Результат.ДобавитьСтроку("Обрабатываем со строки "+Строка(ПерваяСтрокаДанныхВФайле)+" по "+Строка(ТабДокумент.ВысотаТаблицы) );
		//Результат.ДобавитьСтроку("Номер строки и результат: ");
	КонецЕсли;
	
	ПредОрганизация = "";      
	ПредСчет	= "";
	Документ1  = Документы.ВводОстатков.ПустаяСсылка(); // ОстаткиЗадолженностиКлиентов
	Документ2  = Документы.ВводОстатков.ПустаяСсылка(); // ОстаткиЗадолженностиПередПоставщиками
	Документ3  = Документы.ВводОстатков.ПустаяСсылка(); // ОстаткиПоАвансамКлиентов
	Документ4  = Документы.ВводОстатков.ПустаяСсылка(); // ОстаткиПоАвансамПоставщикам
	ДокументСоздан = Ложь;
	
	
	Для Счетчик=ПерваяСтрокаДанныхВФайле По ТабДокумент.ВысотаТаблицы Цикл
		
		ТекСчет	= ТабДокумент.Область(Счетчик,КолСчет,Счетчик,КолСчет).Текст;
		
		ТекОрганизация	= ТабДокумент.Область(Счетчик,КолОргID,Счетчик,КолОргID).Текст;
		
		ТекКонтрагент	= ТабДокумент.Область(Счетчик,КолКонID,Счетчик,КолКонID).Текст;
		ТекДоговор		= ТабДокумент.Область(Счетчик,КолДогID,Счетчик,КолДогID).Текст;
		ВалютаКод		= ТабДокумент.Область(Счетчик,КолВалютаКод,Счетчик,КолВалютаКод).Текст;		
		Если ВалютаКод="" Тогда
			ВалютаКод = "643";
		КонецЕсли;
		
		Если НЕ(ДокументСоздан И (ТекОрганизация = ПредОрганизация) ) Тогда    			
	
			Если ДокументСоздан Тогда								// не первый документ
				Если Документ1.РасчетыСПартнерами.Количество()>0 Тогда
					Документ1.Записать();
					Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ1.Номер+ " от "+Документ1.Дата+" "+Документ1.ХозяйственнаяОперация);
				КонецЕсли;	
				Если Документ2.РасчетыСПартнерами.Количество()>0 Тогда
					Документ2.Записать();
					Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ2.Номер+ " от "+Документ2.Дата+" "+Документ2.ХозяйственнаяОперация);
				КонецЕсли;	
				Если Документ3.РасчетыСПартнерами.Количество()>0 Тогда
					Документ3.Записать();
					Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ3.Номер+ " от "+Документ3.Дата+" "+Документ3.ХозяйственнаяОперация);
				КонецЕсли;	
				Если Документ4.РасчетыСПартнерами.Количество()>0 Тогда
					Документ4.Записать();
					Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ4.Номер+ " от "+Документ4.Дата+" "+Документ4.ХозяйственнаяОперация);
				КонецЕсли;	
			КонецЕсли;
			
			СсылкаОрганизация = СсылкаПоГУИД(ТекОрганизация, Справочники.Организации);
			
			Если СсылкаОрганизация = Неопределено Тогда
				ДокументСоздан = Ложь;
				СообщитьОбОшибке(Счетчик, " Не найдена Организация:"+ТабДокумент.Область(Счетчик,КолОрг,Счетчик,КолОрг).Текст, КолОргID);
			Иначе
				Документ1 						= Документы.ВводОстатков.СоздатьДокумент();
				Документ1.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиКлиентов;
				
				ЗаполнитьШапку(Документ1, СсылкаОрганизация );
				Документ2 						= Документы.ВводОстатков.СоздатьДокумент();
				Документ2.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиПоставщикам;
				
				ЗаполнитьШапку(Документ2, СсылкаОрганизация );
				Документ3 						= Документы.ВводОстатков.СоздатьДокумент();
				Документ3.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ВводОстатковАвансовКлиентов;
				
				ЗаполнитьШапку(Документ3, СсылкаОрганизация );
				Документ4 						= Документы.ВводОстатков.СоздатьДокумент();
				Документ4.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ВводОстатковАвансовПоставщикам;
				
				ЗаполнитьШапку(Документ4, СсылкаОрганизация );
				
				ДокументСоздан = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		
		// новая строка в ТЧ
		Если ДокументСоздан Тогда
			
			СсылкаКонтрагент = СсылкаПоГУИД(ТекКонтрагент, Справочники.Контрагенты);
			СсылкаДоговор	 = СсылкаПоГУИД(ТекДоговор, Справочники.ДоговорыКонтрагентов);
			
			СуммаВал = ЧислоЯчейки(ТабДокумент.Область(Счетчик,КолВалСумма,Счетчик,КолВалСумма).Текст);
			СуммаРег = ЧислоЯчейки(ТабДокумент.Область(Счетчик,КолСумма,Счетчик,КолСумма).Текст);
			Коммент  =ТабДокумент.Область(Счетчик,КолДок,Счетчик,КолДок).Текст;
			
			Если СсылкаКонтрагент = Неопределено Тогда 				
				СообщитьОбОшибке(Счетчик, " Не найден Контрагент:"+ТабДокумент.Область(Счетчик,КолКон,Счетчик,КолКон).Текст, КолКонID);
			ИначеЕсли СсылкаДоговор = Неопределено Тогда
				СообщитьОбОшибке(Счетчик, " Не найден Договор:"+ТабДокумент.Область(Счетчик,КолДог,Счетчик,КолДог).Текст, КолДогID);
			ИначеЕсли ВалютаКод <> СсылкаДоговор.ВалютаВзаиморасчетов.Код Тогда
				СообщитьОбОшибке(Счетчик, " Не совпадает валюта Договора и из файла:"+ТабДокумент.Область(Счетчик,КолДог,Счетчик,КолДог).Текст, КолВалютаКод);
			ИначеЕсли СуммаВал = 0 И НЕ(ВалютаКод = "643") Тогда
				СообщитьОбОшибке(Счетчик, " Нулевая сумма", КолВалСумма);
			Иначе	
				Если Ложь Тогда
					//НомерПерв=ТабДокумент.Область(Счетчик,КолДокНомер,Счетчик,КолДокНомер).Текст;
					//ДатаПерв =ТабДокумент.Область(Счетчик,КолДокДата,Счетчик,КолДокДата).Текст;
					//СуммаПерв=ЧислоЯчейки(ТабДокумент.Область(Счетчик,КолДокСумма,Счетчик,КолДокСумма).Текст);
					//РеглПерв =СуммаПерв * ЧислоЯчейки(ТабДокумент.Область(Счетчик,КолДокКурс,Счетчик,КолДокКурс).Текст);
				Иначе
					НомерПерв="7602-"+Счетчик;
					ДатаПерв =Строка(ДатаДокументов);
					
					Если ВалютаКод = "643" Тогда
						СуммаПерв=?(СуммаРег>0, СуммаРег, -СуммаРег);
						РеглПерв =СуммаПерв;
					Иначе	
						СуммаПерв=?(СуммаВал>0, СуммаВал, -СуммаВал);
						РеглПерв =?(СуммаВал>0, СуммаРег, -СуммаРег);
					КонецЕсли;
				КонецЕсли;
				
				
				Если Коммент="С поставщиком"  Тогда												// Задолженность перед поставщиками
					Если СуммаРег > 0 Тогда
						ЗаполнитьТЧ(Документ2, СсылкаКонтрагент, СсылкаДоговор, ВалютаКод, СуммаВал, СуммаРег, ТекСчет, НомерПерв, ДатаПерв, СуммаПерв, Коммент, РеглПерв);
					Иначе
						ЗаполнитьТЧ(Документ4, СсылкаКонтрагент, СсылкаДоговор, ВалютаКод, -СуммаВал, -СуммаРег, ТекСчет, НомерПерв, ДатаПерв, СуммаПерв, Коммент, РеглПерв);
					КонецЕсли;	
				Иначе								 											// Задолженность клиентов
					Если СуммаРег > 0 Тогда
						ЗаполнитьТЧ(Документ1, СсылкаКонтрагент, СсылкаДоговор, ВалютаКод, СуммаВал, СуммаРег, ТекСчет, НомерПерв, ДатаПерв, СуммаПерв, Коммент, РеглПерв);
					Иначе
						ЗаполнитьТЧ(Документ3, СсылкаКонтрагент, СсылкаДоговор, ВалютаКод, -СуммаВал, -СуммаРег, ТекСчет, НомерПерв, ДатаПерв, СуммаПерв, Коммент, РеглПерв);
					КонецЕсли;	
					КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПредОрганизация = ТекОрганизация;
		ПредСчет		= ТекСчет;
		
	
		
	КонецЦикла;
		
		
	Если Документ1.РасчетыСПартнерами.Количество()>0 Тогда
		Документ1.Записать();
		Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ1.Номер+ " от "+Документ1.Дата+" "+Документ1.ХозяйственнаяОперация);
	КонецЕсли;	
	Если Документ2.РасчетыСПартнерами.Количество()>0 Тогда
		Документ2.Записать();
		Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ2.Номер+ " от "+Документ2.Дата+" "+Документ2.ХозяйственнаяОперация);
	КонецЕсли;	
	Если Документ3.РасчетыСПартнерами.Количество()>0 Тогда
		Документ3.Записать();
		Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ3.Номер+ " от "+Документ3.Дата+" "+Документ3.ХозяйственнаяОперация);
	КонецЕсли;	
	Если Документ4.РасчетыСПартнерами.Количество()>0 Тогда
		Документ4.Записать();
		Результат.ДобавитьСтроку(Строка(Счетчик)+" Создан документ "+Документ4.Номер+ " от "+Документ4.Дата+" "+Документ4.ХозяйственнаяОперация);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ЭтаФорма.ДатаДокументов = ТекущаяДата();   
	ЭтаФорма.ДатаДокументов = ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ЭтаФорма.ДатаДокументов = Дата(2020,6,30,23,59,59);
	ЭтаФорма.Менеджер		= Пользователи.ТекущийПользователь();
	ЭтаФорма.ПропускатьНулевыеКолва = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоки(Команда)
	СоздатьДокиНаСервере();
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Результат;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ(Документ, СсылкаКонтрагент, СсылкаДоговор, ВалютаКод, СуммаВал, СуммаРег=0, ТекСчет, НомерПерв="", ДатаПерв="", СуммаПерв=0, Коммент="", РеглПерв=0)
	
	Строка = Документ.РасчетыСПартнерами.Добавить();
	Строка.Контрагент	= СсылкаКонтрагент;
	Строка.Партнер		= СсылкаКонтрагент.Партнер;
	
	Строка.Договор		= СсылкаДоговор;
	Если ВалютаКод = "643" Тогда
		Строка.Сумма		= СуммаРег;	
	Иначе	
		Строка.Сумма		= СуммаВал;	
	КонецЕсли;
	
	Строка.ДатаПлатежа  = ДатаДокументов;
	
	Строка.СуммаРегл	= СуммаРег;
	Строка.СуммаУпр		= СуммаРег;
	
	Строка.Договор			= Справочники.ДоговорыКонтрагентов;
	Строка.ОбъектРасчетов	= СсылкаДоговор;
	Строка.ВалютаВзаиморасчетов = СсылкаДоговор.ВалютаВзаиморасчетов;
	Строка.ДокументРасчетов = СоздатьПервичныйДокумент(Документ, СсылкаКонтрагент, СсылкаДоговор, Строка.ВалютаВзаиморасчетов, СуммаПерв, ТекСчет, НомерПерв, ДатаПерв, Коммент, РеглПерв);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПервичныйДокумент(Документ, СсылкаКонтрагент, СсылкаДоговор, Валюта, СуммаВал, ТекСчет, НомерПерв, ДатаПерв, Коммент, РеглПерв)
	
	ПервичныйДокумент = Документы.ПервичныйДокумент.СоздатьДокумент();
	ПервичныйДокумент.Дата			= Документ.Дата; 
	ПервичныйДокумент.Организация	= Документ.Организация; 
	ПервичныйДокумент.Контрагент 	= СсылкаКонтрагент; 
	ПервичныйДокумент.Договор 		= СсылкаДоговор; 
	ПервичныйДокумент.Партнер		= СсылкаКонтрагент.Партнер; 
	ПервичныйДокумент.Валюта 		= Валюта; 
	ПервичныйДокумент.СуммаДокумента= СуммаВал; 
	ПервичныйДокумент.СуммаРегл		= РеглПерв; 
	ПервичныйДокумент.Комментарий	= "#Создана загрузкой по задаче №11411 ";
	ПервичныйДокумент.ПорядокРасчетов= Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	ПервичныйДокумент.НомерВходящегоДокумента	= НомерПерв; 
	ПервичныйДокумент.ДатаВходящегоДокумента	= Дата(ДатаПерв);
	
	Если Коммент="С поставщиком" Тогда		// Задолженность перед поставщиками
		ПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ОплатаПоставщику;
	Иначе																			 // Задолженность клиентов
		ПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ОплатаОтКлиента;
	КонецЕсли;
	
	                                      
	ПервичныйДокумент.Записать();
	Возврат ПервичныйДокумент.Ссылка;
КонецФункции


&НаСервере
Функция ЗаполнитьШапку(Документ, Организация, Счет="")
	
	Документ.Дата			= ДатаДокументов;
	Документ.Менеджер		= Менеджер;
	Документ.Ответственный	= Менеджер;
	Документ.Организация	= Организация;
	
	Документ.ОтражатьВБУиНУ				= Истина;
	Документ.ОтражатьВУУ				= Истина;
	Документ.ОтражатьВОперативномУчете	= Истина;
	Документ.Комментарий	= "#Создан загрузкой 11185";
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";
	ДиалогВыбора.Фильтр = "MXL (*.mxl)";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	
	ЗагрузитьТабличныйДокументИзФайла(Адрес, ИмяФайла);
	
	Элементы.СоздатьДоки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличныйДокументИзФайла(Адрес, ИмяФайла)
	
	Расширение = Прав(ИмяФайла,3);
	
	ФайлПриемник = ПолучитьИмяВременногоФайла(Расширение);
	ДанныеХранилища = ПолучитьИзВременногоХранилища(Адрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	ТабДокумент.Очистить();
	ТабДокумент.Прочитать(ФайлПриемник,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧислоЯчейки(Текст)
	
	Текст = СтрЗаменить(СокрЛП(Текст),Символы.НПП,"");
	Если Текст="" Тогда
		Возврат 0;
	Иначе
		Попытка
			Возврат Число(Текст);
		Исключение
			Возврат 0;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаПоГУИД(УИД, ОбластьПоиска)
	
	Попытка
		GUID	= Новый УникальныйИдентификатор(УИД);
		Ссылка  = ОбластьПоиска.ПолучитьСсылку(GUID);
		Если Лев(Строка(Ссылка),7)="<Объект" Тогда 
			Ссылка = Неопределено;
		КонецЕсли;
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
КонецФункции

&НаСервере
Процедура СообщитьОбОшибке(Счетчик, Текст, Колонка=0)
	
	Результат.ДобавитьСтроку(Строка(Счетчик)+" строка."+Текст);
	
	ТабДокумент.Область(Счетчик,1,Счетчик,ТабДокумент.ШиринаТаблицы).ЦветФона = WebЦвета.ОранжевоКрасный;
	ТабДокумент.Область(Счетчик,Колонка,Счетчик,Колонка).ЦветФона = WebЦвета.Красный;
	
КонецПроцедуры
